{
  "DbFilename": "Recipes.json",
  "Storage": [
    {
      "Id": 1,
      "Name": "Луковый суп ",
      "CategoryId": 8,
      "Explanation": "Репчатый лук очистить,нарезать полу кольцами,зелёный лук вымыть,нашинковать,чеснок очистить,мелко порубить.В кастрюле разогреть сливочное масло,обжарить с начала репчатый лук в течении 2-3х минут помешивая, затем добавить чеснок и зелёный лук,жарить помешивая минут пять.",
      "IngredientsId": {
        "1": 3.0,
        "3": 1.0,
        "4": 1.0,
        "5": 1.0,
        "6": 3.0,
        "7": 1.5,
        "8": 150.0,
        "9": 2.0,
        "10": 0.2
      },
      "Steps": [
        "1 . Нагреть бульон",
        "2 . 3. Репчатый лук очистить,нарезать полу кольцами,зелёный лук вымыть,нашинковать,чеснок очистить,мелко порубить.",
        "3 . В кастрюле разогреть сливочное масло,обжарить с начала репчатый лук в течении 2-3х минут помешивая, затем добавить чеснок и зелёный лук,жарить помешивая минут пять",
        "4 . К луку добавить очищенный от семян, нарезанный тонкими полосками болгарский перец,жарить все овощи минуты три помешивая",
        "5 . влить бульон,довести до кипения и варить на маленьком огне 5-6 мину.",
        "6 . Пока варится бульон с овощами, отварить в течении 6-7 минут в кипящей воде рисовую лапшу,откинуть на дуршлаг,промыть в холодной воде",
        "7 . В соевый соус добавить крахмал",
        "8 . промыть в холодной воде,лапшу опустить в кипящий бульон и сразу выключить огонь.Дать супу постоять 5 минут.",
        "9 . Подавать посыпав острым молотым перцем."
      ]
    },
    {
      "Id": 2,
      "Name": "Пряный луковый суп",
      "CategoryId": 8,
      "Explanation": "Пряный луковый суп по-персидски. Лук нарезать полукольцами, обжаривать на 2 ст.л. оливкового масла на маленьком огне минут 10, добавив соль и перец, периодически помешивая.",
      "IngredientsId": {
        "3": 6.0,
        "7": 1.0,
        "12": 3.0,
        "13": 10.0,
        "15": 1.0,
        "16": 1.0,
        "17": 1.0,
        "18": 1.0,
        "19": 1.0,
        "20": 2.0
      },
      "Steps": [
        "1 . Увеличить огонь, добавить пряности, муку и оставшееся масло, готовить 3-4 минуты, постоянно помешивая, чтобы не образовались комочки.",
        "2 . Постепенно влить бульон, добавить палочку корицы, готовить 35-40 минут.",
        "3 . В конце варки добавить лимонный сок и сахар, вынуть корицу. Проверить на соль и перец, снять с огня.",
        "4 . Разлить по тарелкам, посыпать рубленной петрушкой и подавать."
      ]
    },
    {
      "Id": 3,
      "Name": "Борщ с мясопродуктами",
      "CategoryId": 9,
      "Explanation": "Вообще, борщ одно из моих любимых блюд. Я готовил много вариаций этого блюда. Однако мой любимый - густой, наваристый на мясном бульоне с копченостями) Догадываюсь, я не один такой)))",
      "IngredientsId": {
        "3": 2.0,
        "5": 5.0,
        "11": 0.15,
        "18": 1.0,
        "21": 350.0,
        "22": 100.0,
        "23": 2.0,
        "25": 50.0,
        "26": 2.0,
        "27": 1.0,
        "28": 1.0
      },
      "Steps": [
        "1 . Сперва варим бульон. Из готового бульона достаем уже вареное мясо и овощи",
        "2 . На сковороде пассируем лук с морковью, добавляем томатную пасту, залив небольшим количеством воды, даем немного протушится и отправляем в кастрюлю с бульоном.",
        "3 . Туда же кладется и нарезанный средним(или крупным - так тоже аппетитно) картофель. ",
        "4 . На сковороде слегка обжариваем свеклу, заливаем водой и тушим с добавлением уксуса. А теперь самое интересное - свеклу заправляем сметаной.",
        "5 . Тушеная со сметаной свекла кладется в кастрюлю. Когда сварится картофель (это важно), борщ заправляется нарезанной тонкой соломкой капустой. ",
        "6 . Кладем обжаренные сало с копченостями, доводим до вкуса солью, перцем и небольшим количеством сахара. За пять минут кладем чеснок."
      ]
    },
    {
      "Id": 4,
      "Name": "Борщ с телятиной",
      "CategoryId": 9,
      "Explanation": "Отличный и вкусный борщ!",
      "IngredientsId": {
        "3": 1.0,
        "11": 3.0,
        "18": 1.0,
        "19": 1.0,
        "23": 1.0,
        "27": 2.0,
        "29": 1.0,
        "30": 2.0,
        "31": 0.5,
        "32": 1.0,
        "33": 2.0
      },
      "Steps": [
        "1 . ребрышки залить водой, довести до кипения, снять пену (можно положить лавровый лист) прикрыть крышкой, варить 1,5 часа.",
        "2 . Достать ребрышки, отделить мясо от костей.",
        "3 . В бульон положить нашинкованную свежую капусту и картофель, варить минут 15-20",
        "4 . Нашинкованную свеклу, морковь потушить с нарезанным луком,помидором , томатной пастой, паприкой минут 15-20 под крышкой.",
        "5 . Добавить в смесь сахар и лимонный сок, перемешать. Положить в бульон туда же рубленую зелень. прогреть минут 5-10",
        "6 . Соль,перец по вкусу",
        "7 . "
      ]
    },
    {
      "Id": 5,
      "Name": "Рис по-китайски",
      "CategoryId": 4,
      "Explanation": "Рис рассыпчатый, свежий зеленый горошек задает я бы сказала основную нотку вкуса этому блюду.Соевый соус делает такой рис в меру соленым.Результатом я осталась довольна - готовится, как видите, быстро, не хлопотно, а на вкус судите сами - но моя семья оценила на 5 с плюсом!",
      "IngredientsId": {
        "3": 2.0,
        "23": 2.0,
        "34": 1.0,
        "35": 1.0,
        "36": 4.0,
        "37": 12.0,
        "38": 3.0,
        "39": 250.0
      },
      "Steps": [
        "1 . Первым делом отвариваю рис. Воду не солю.",
        "2 . Далее мелко режу половинку репчатого лука, половину моркови натираю на мелкой терке.",
        "3 . В сковородку наливаю растительное масло и выкладываю овощи, к ним же отправляю зеленый горошек.",
        "4 . Потушив овощи минут пять, закладываю порезанное филе куриной грудки.Когда курица начнет белеть, заливаю соевый соус и продолжаю тушить.",
        "5 . В отдельную посуду разбиваю 4 яйца, вообще сюда тоже лучше добавить ст.л. соевого соуса, в этот раз я не добавляла.",
        "6 . Потушив овощи минут пять, закладываю порезанное филе куриной грудки.",
        "7 . Когда курица начнет белеть, заливаю соевый соус и продолжаю тушить.",
        "8 . В отдельную посуду разбиваю 4 яйца, вообще сюда тоже лучше добавить ст.л. соевого соуса, в этот раз я не добавляла.",
        "9 . Яйцо выливаю на разогретую сковородку и постоянно помешиваю, получаю вот такую яичницу.",
        "10 . К овощам отправляется готовый рис, следом за ним яичница, по желанию немного соевого соуса и семена кунжута.Перемешиваю и даю блюду настояться минут 5-10."
      ]
    },
    {
      "Id": 6,
      "Name": "Гречка в духовке",
      "CategoryId": 4,
      "Explanation": "Вкусная гречка",
      "IngredientsId": {
        "3": 1.0,
        "6": 5.0,
        "13": 10.0,
        "34": 1.0,
        "40": 300.0,
        "41": 100.0,
        "42": 5.0,
        "43": 80.0,
        "44": 3.0
      },
      "Steps": [
        "1 . Заранее отвариваем 100 гр. гречки в пропорции 1:3, в процессе варки солим по вкусу.",
        "2 . Мелко нарезаем лук и грибы, обжариваем на смеси сливочного и растительного масла сначала лук, а потом добавляем грибы, солим и перчим по вкусу.",
        "3 . В отваренную гречку вливаем сливки, затем добавляем грибы с луком, перемешиваем.",
        "4 . Выкладываем в форму, смазанную сливочным маслом, посыпаем сыром.",
        "5 . Запекаем в духовке, разогретой до 180 градусов около 20 минут."
      ]
    },
    {
      "Id": 7,
      "Name": "Стейк в маринаде ",
      "CategoryId": 5,
      "Explanation": "Стейк в ароматном луковом маринаде",
      "IngredientsId": {
        "3": 1.0,
        "5": 2.0,
        "6": 4.0,
        "21": 500.0,
        "30": 2.0,
        "34": 3.0,
        "44": 1.0,
        "45": 1.0,
        "46": 0.5
      },
      "Steps": [
        "1 . Говядину нарезаем толстыми кусками, примерно в 2 пальца толщиной. Складываем в миску, добавляем лук, очищенный и натёртый на тёрке в кашицу. Вливаем растительное масло и перемешиваем, втирая сок лука и масло в мясо, оставляем минимум на 30минут при комнатной температуре, если планируете мариновать дольше - уберите в холодильник.",
        "2 .  Счищаем с кусков мяса лук, жарим на сухой сковороде гриль (без масла), по 2,5-3минуты с каждой стороны, периодически прижимая мясо лопаточкой к сковороде. Снимаем со сковороды, убираем в тепло или просто заворачиваем с фольгу, даём полежать половину времени приготовления, в нашем случае 2,5-3минуты, чтобы соки перераспределились, и мясо стало нежным, сочным и мягким.",
        "3 . Для масла: измельчаем все ароматные составляющие и смешиваем с размягчённым маслом, добавляем чайную ложку соли, перец по вкусу, заворачиваем в фольгу, придавая форму колбаски, и убираем в холод или сразу подаём к столу.",
        "4 . На горячие, готовые стейки выкладываем по кусочку ароматного масла, подаём с гарниром по вашему вкусу, у нас была жаренная с луком картошка."
      ]
    },
    {
      "Id": 8,
      "Name": "Котлеты из говядины с яблоками",
      "CategoryId": 5,
      "Explanation": "",
      "IngredientsId": {
        "3": 1.0,
        "5": 3.0,
        "12": 1.0,
        "21": 800.0,
        "29": 5.0,
        "36": 1.0,
        "42": 200.0,
        "46": 1.0,
        "47": 25.0,
        "48": 4.0,
        "49": 1.0,
        "50": 5.0
      },
      "Steps": [
        "1 . Хлеб разделить на сегменты и залить сливками.",
        "2 . Прокрутить фарш в мясорубке или измельчить мясо в блендере с добавлением хлеба, лука и чеснока.",
        "3 . Яблоки нужно натереть на крупной терке...отжать сок руками...куда-то его применить, а мякоть отправить в фарш.",
        "4 . Добавить специи, табаско, яйцо и хорошенько перемешать.",
        "5 . Добавить специи, табаско, яйцо и хорошенько перемешать.",
        "6 . Сформировать плоские круглые котлетки и обжарить их с двух сторон в оливковом масле."
      ]
    },
    {
      "Id": 9,
      "Name": "Овсяное печенье с шоколадом",
      "CategoryId": 6,
      "Explanation": "Горячее печенье будет мягким в центре, если его потрогать осторожно пальцем.Остывая печенье будет хрустящим.",
      "IngredientsId": {
        "36": 2.0,
        "51": 80.0,
        "52": 10.0,
        "53": 8.0,
        "54": 90.0,
        "55": 300.0,
        "56": 200.0,
        "57": 180.0,
        "58": 160.0
      },
      "Steps": [
        "1 . Все продукты должны быть комнатной температуры.",
        "2 . Мягкое масло растереть с двумя видами сахара обычным и коричневым (тростниковый сахар имеет карамельный аромат и вкус, которые чувствуешь в выпечке) при помощи миксера.",
        "3 . Когда масло хорошо объединится с сахаром, добавить яйца, ванильный сахар, хорошо размешать.",
        "4 . Добавить муку, разрыхлитель, овсяные хлопья, шоколад, хорошо размешать сперва ложкой, а затем руками.",
        "5 . Замесить тесто.Тесто будет вязким и послушным.Чайной ложкой соберите тесто в шарик размером с грецкий орех.",
        "6 . На противень постелить пергамент, разложить шарики на расстоянии 4-5 см. друг от друга.",
        "7 . Духовку разогреть до 180 градусов.Выпекать до лёгкого румянца, примерно 10-15 минут.Горячее печенье будет мягким в центре, если его потрогать осторожно пальцем"
      ]
    },
    {
      "Id": 10,
      "Name": "Пирог с орехами и маком",
      "CategoryId": 6,
      "Explanation": "Вкусный пирог",
      "IngredientsId": {
        "18": 5.0,
        "36": 4.0,
        "52": 10.0,
        "56": 300.0,
        "57": 150.0,
        "60": 20.0
      },
      "Steps": [
        "1 . Смешать яйца, сахар и мягкое масло (при необходимости масло можно растопить).",
        "2 . В готовую смесь добавить муку и разрыхлитель.",
        "3 . Разделить тесто на 3 части.",
        "4 . В 1 - добавить какао, во 2 - мак, в 3- рубленные орехи.",
        "5 . Выложить в смазанную маслом чашу мультиварки последовательно 3 слоя, в любом порядке.",
        "6 . Готовить 1 час на режиме <выпечка> или <мультиповар 130С>."
      ]
    },
    {
      "Id": 11,
      "Name": "Груши в желе",
      "CategoryId": 7,
      "Explanation": "Приятного аппетита!",
      "IngredientsId": {
        "14": 3.0,
        "58": 100.0,
        "62": 2.0,
        "64": 2.0,
        "65": 400.0
      },
      "Steps": [
        "1 . Сахар соединить с водой, поставить на огонь и довести до кипения. Добавить куркуму.",
        "2 . Груши очистить от кожицы. Отварить с сиропе до мягкости.",
        "3 . Желе развести горячей водой согласно инструкции на обороте пакетика.",
        "4 . В креманки вылить желе и выложить груши. Остудить и убрать в холодильник до полного застывания.",
        "5 . "
      ]
    }
  ]
}